app/controllers/pins_controller.rb

  def index
    @pins = Pin.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 8)
---
SELECT  "pins".* FROM "pins"  ORDER BY created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "pins"

  def create
    @pin = current_user.pins.build(pin_params)

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Hello World"], ["user_id", 1], ["created_at", "2016-06-28 15:53:23.357103"], ["updated_at", "2016-06-28 15:53:23.357103"]]

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "ddddddddddddddddd"], ["updated_at", "2016-06-29 16:53:20.952798"], ["id", 3]]